# sVTI-based VPN

Trainer: Charles Judd


- Demo: config static virtual tunnel interfaces (sVTI) VPN
  - no crypto or acl list required
  - topology: R1 <-> R2
    - IP addr subnet: 10.10.10.0/30
    - R1 intf: G0/0 w/ .1
    - R2 intf: G0/0 w/ .2
  - UDP port 500 used by IPsec based VPNs for establishing secure tunnels


- Demo: config for ISAKMP Phase 1 on R1
  
  ```cisco
  R1# ! config ISAKMP Phase 1
  R1# conf t
  R1(config)# crypto isakmp policy 1
  R1(config-isakmp)# hash sha512
  R1(config-isakmp)# auth pre-share
  R1(config-isakmp)# group 14
  R1(config-isakmp)# lifetime 3600
  R1(config-isakmp)# encr aes 256
  R1(config-isakmp)# crypto isakmp key cisco address 10.10.10.2
  R1(config)# do sh crypto isakmp policy
  ```

- DEmo: config for ISAKMP Phase 2 on R1
  - config ipsec transform set: `R1(config)# crypto ipsec transform-set REMOTE esp-aes 256 esp-sha512-hmac`
  - config tunnel mode: `R1(cfg-crypto-trans)# mode tunnel`


- Demo: applying profile to tunnel interface on R1
  - tasks
    - creating a tunnel interface
    - adding IPsec profile to the tunnel interface
  - similar to creating a GRE tunnel where src & dst addr set
  - crypto profile
    - 
  - create IPsec profile: `R1(cfg-crypto-trans)# crypto ipsec profile IPSEC`
  - apply transform set: `R1(ipsec_profile)# set transform-set REMOTE`
  - create tunnel intf: `R1(config)# int tunnel 0`
  - config IP addr for tunnel intf: `R1(config-if)# ip address 50.50.50.1 255.255.255.0`
  - config src addr: `R1(config-if)# tunnel source 10.10.10.1`
  - config dst addr: `R1(config-if)$ tunnel destination 10.10.10.2`
  - specify the Ipsec tunnel mode w/ IPv4: `R1(config-if)$ tunnel mode ipsec ipv4`
  - config tunnel protection w/ IPSEC profile: `R1(config-if)$ tunnel protection profile IPSEC`


- Demo: config IPsec tunnel on R2

  ```cisco
  R2# ! config ISAKMP Phase 1
  R2# conf t
  R2(config)# crypto isakmp policy 1
  R2(config-isakmp)# hash sha512
  R2(config-isakmp)# auth pre-share
  R2(config-isakmp)# group 14
  R2(config-isakmp)# lifetime 3600
  R2(config-isakmp)# encr aes 256
  R2(config-isakmp)# crypto isakmp key cisco address 10.10.10.1
  R2(config)# do sh crypto isakmp policy

  ! config ISAKMP Phase w/ IPsec tunnel
  R2(config)# crypto ipsec transform-set REMOTE esp-aes 256 esp-sha512-hmac
  R2(cfg-crypto-trans)# mode tunnel
  R2(cfg-crypto-trans)# crypto ipsec profile IPSEC
  R2(ipsec_profile)# set transform-set REMOTE

  ! config virtual tunnel w/ secure profile
  R2(config)# int tunnel 0
  R2(config-if)# ip address 50.50.50.2 255.255.255.0
  R2(config-if)# tun source 10.10.10.2
  R2(config-if)# tun dest 10.10.10.1
  R2(config-if)$ tun mode ipsec ipv4
  R2(config-if)$ tun protection profile IPSEC
  R2(config-if)# end
  R2# sh ip int br
  Interface   IP-Address  OK? Method  Status  Protocol
  ...
  Tunnel0     50.50.50.2  YES manual  up      up

  R2# sh int tun 0
  Tunnel0 is up, line protocol is up
    Hardware is Tunnel
    Internet adddress is 50.50.50.2/24
    ...
    Encapsulation TUNNEL, loopback not set
    ...
    Tunnel source 10.10.10.2 destination 10.10.10.1
    Tunnel protocol/transport IPSEC/IP
  
  R2# sh crypto session
  Crypto session current status

  Interface: Tunnel0
  Session status: UP-ACTIVE
  peer: 10.10.10.1 port 500
    Session ID: 0
    IKEv1 SA: local 1.10.10.2/500 remote 10.10.10.1/500 Active
    IPSEC FLOW: permit ip 0.0.0.0/0.0.0.0 0.0.0.0/0.0.0.0
        Active SAs: 4, original: crypto map
  ```


