# Site-to-site VPN

Trainer: Charles Judd


- Site-to-site VPN 
  - topology: two cisco firewall router
  - IP address subnet: 10.10.10.0/30
  - R1 interface: G0/0 w/ .1
  - R2 interface: G0/0 2/ .2

- Demo: Config IKEv1 ISAKMP Phase 1 on R1
  - tasks:
    - IKEv2 ISAKMP Phase 1: policy, Diffie-Hellman key exchange, identity validation
  - displaying interface info: `R1# sh ip int br` $\to$ IP-addr 10.10.10.1
  - entering global configuration: `R1# conf t`
  - config ISAKMP policy 1: `R1(config)# crypto isakmp policy ?` $\to$ `crypto isakmp policy 1`
  - show commands in ISAKMP config (HAGLE): `R1(config-isakmp)# ?` $\to$ `hash`, `authentication`, `group`, `lifetime`, `encryption`, `default`, `exit`, `no`
  - config authentication w/ pre-shared key: `R1(config-isakmp)# authentication pre-share`
    - `rsa-sig`: RAS-signature requiring a certificate authority connected
    - `rsa-encr`: RSA encryption for RAS public key exchange
  - config encryption w/ AES: `R1(config-isakmp)# encryption aes 256` (DES & 3DES legacy)
  - config group w/ Diffie-Hellman group 14 (2048 bit): `R1(config-isakmp)# group 14`
  - config hash w/ SHA512: `R1(config-isakmp)# hash sha512`
  - config lieftime w/ 3600 seconds: `R1(config-isakmp)# lifetime 3600`
  - exit ISAKMP config: `R1(config-isakmp)# end`
  - verify configuration: `R1# sh crypto isakmp policy`

    ```bash
    Global IKE policy
    Protection suite of priority 1
        encryption algorithm:   AES - Advanced Encryption Standard (256 bite keys).
        hash algorithm:         Secure Hash Standard 2 (512 bit)
        authentication method:  Pre-Shared key
        Diffie-Hellman group:   #14 (2048 bit)
        lifetime:               3600 seconds, no volume limit
    ```

  - R1 ISAKMP Key config for pe-shared key $\to$ secure tunnel
    - enter global config: `R1# config t`
    - config key for IPsec: `R1(config)# crypto isakmp key 6 cisco address 10.10.10.2`
      - `0`: unencrypted password
      - `6`: encrypted password
      - `WORD`: unencrypted (clear-text) user password
      - `cisco`: password
      - `address x.x.x.x`: the IP addr of the other party


- Demo: config IKEv1 phase 2 on R1 $\to$ IPsec
  - config IPsec transform set: `R1(config)# crypto ipsec transform-set REMOTE esp-aes 256 esp-sha512-hmac`
    - `esp-aes`: encapsulation method, AH/ESP options, ESP recommended
    - `256`: bits for ESP-AES option
    - `esp-sha512-hmac`: authentication method
  - enter transform set config mode: `R1(cfg-crypto-trans)# ?` $\to$ `mode`, `default`, `exit`, `no`
  - config w/ transfor mode: `R1(cfg-crypto-trans)# mode transport` (or `trunnel`)
  - end config: `R1(cfg-crypto-trans)# exit`
  - verify: `R1# sh crypto ipsec transform-set`

    ```bash
    Transform set default: { esp-aes esp-sha-hmac  }
      will negotiate = { Transport, },
    
    Transform set REMOTE: { esp-256-aes esp-sha512-hmac }
      will negotiate = { Transport, },
    ```

- Demo: bind settings and apply to intf
  - display access list: `R1# sh access-list`

    ```bash
    Extended IP access-list 101
        10 permit ip host 10.10.10.10.2
    ```
  
  - crypto map:
    - old method about GRE over IPsec Crypro map
    - traffic encrypted w/ matched extended ACL
    - created for IPsec set up SA parameters
  - create crypto map: `R1(config)# crypto map MAP 1 ipsec-isakmp`
    - `MAP`: name of the map
    - `1`: sequence number
    - Note: The new crypto map will remain disable until a peer and a valid access list has been configured
  - apply access list: `R1(config-crypto-map)# match address 101`
    - `address`: match address of packets to encrypt
  - apply transform set: `R1(config-crypto-map)# set transform-set REMOTE`
  - config peer addr: `R1(config-crypto-map)# set peer 10.10.10.2`
  - change to designated intf: `R1(config-crypto-map)# int gig 0/0`
  - apply setting to intf: `R1(config-if)# crypto map MAP`
  - exit config: `R1(config-if)# end`
  - verify settings: `R1# sh crypto map`

    ```bash
    Crypto Map IPv4 "MAP" 1 ipsec-isakmp
      Peer = 10.10.10.2
      Extended IP access list 101
        access-list 101 permit ip host 10.10.10.1 host 10.10.10.2
      Current peer: 10.10.10.2
      Security association lifetime 4608000 kilobytes/3600 seconds
      Responder-Only: (Y/N): N
      RFS (Y?N): N
      Mixed-mode: Disabled
      Transform sets={
        REMOTE: { esp-256-aes esp-sha512-hmac } ,
      }
      Interface using crypto map MAP:
        GigabitEthernet0/0

      Interfaces using crypto map NiStTeSt1
    ```


- Demo: config IPsec on R2

  ```bash
  R2# sh ip int br
  R2# conf t
  
  ! config isakmp policy - IKEv1 Phase 1
  R2(config)# crypto isakmp policy 1
  R2(config-isakmp)# hash sha2
  R2(config-isakmp)# authentication pre-share
  R2(config-isakmp)# group 14
  R2(config-isakmp)# lieftime 3600
  R2(config-isakmp)# encryption aes 256
  R2(config-isakmp)# end
  ```

  ```bash
  ! verify policy
  R2# sh crypto isakmp policy
  Global IKE policy
  Protection suite of priority 1
      encryption algorithm:   AES - Advanced Encryption Standard (256 bite keys).
      hash algorithm:         Secure Hash Standard 2 (512 bit)
      authentication method:  Pre-Shared key
      Diffie-Hellman group:   #14 (2048 bit)
      lifetime:               3600 seconds, no volume limit
  ```

  ```bash
  ! config isakmp key - pre-shared key: cisco
  R2# conf t
  R2(config)# crypto isakmp key cisco address 10.10.10.1
  ```

  ```bash
  ! config IPsec transform set - IKEv1 phase 2
  R2(config)# crypto ipsec transfor-set REMOTE esp-aes 256 esp-sha512-hmac
  R2(cfg-crypto-trans)# mode transport
  R2(cfg-crypto-trans)# end
  R2# sh crypto ipsec transform-set
  Transform set default: { esp-aes esp-sha-hmac  }
    will negotiate = { Transport, },    
  Transform set REMOTE: { esp-256-aes esp-sha512-hmac }
    will negotiate = { Transport, },
  ```

  ```bash
  ! config ro bind ipsec & isakmp then apply to intf
  R2# conf t
  R2(config)# crypto map MAP 1 ipsec-isakmp
  % NOTE: The new crypto map will remain disable until a peer 
          and a valid access list has been configured
  R2(config-crypto-map)# match address 101
  R2(config-crypto-map)# set transform-set REMOTE
  R2(config-crypto-map)# set peer 10.10.10.1
  R2(config-crypto-map)# int gig 0/0
  R2(config-if)# crypto map MAP
  R2(config-if)# end
  *Nov 17 16:23:49.954: %CRYPTO-6-ISAKMP_ON_OFF: ISAKMP is ON
  ...
  ```
  
  ```bash
  ! verify connectivity & ISAKMP SA
  R2# ping 10.10.10.1
  R2# pint 10.10.10.1
  R2# sh crypto isakmp SA
  IPv4 Crypto ISAKMP SA
  dst         src         state     conn-id status
  10.10.10.1  10.10.10.2  QM_IDLE      1001 ACTIVE

  IPv6 Crypto ISAKMP SA
  ```
  
  ```bash
  ! verify IPsec SA
  R2# sh crypto ipsec sa
  interface: GigabitEthernet0/0
      Crypto map tag: MAP, local addr 10.10.10.2

    protected vrf: (none)
    local ident ...
    remote ident ...
    current_peer 10.10.10.1 port 500
      PERMIT, flags={origin_is_acl,}
     #pkts encaps: 10,  #pkts encrypt: 10, #pkts digest: 10
     #pkts decaps: 10,  #pkts encrypt: 10, #pkts digest: 10
     ...
  ```



