# NTP with authentication

Trainer: Charles Judd


- Demo: config NTP authentication
  - topology: R1 <-> NTP
    - subnet: 10.1.1.0/24
    - R1: G0/0 w/ .1
    - NTP server: .50
  - NTP server settings: NTP Service = On; Authentication = Enable; Key = 1; Password = cisco
  - display current time on R1: `R1# sh clock`
    - result: `*0:5:58.613 UTC Mon Mar 1 1993`
    - `*`: indicating time is not authoritative
  - display more time info: `R1# sh clock detail` $\to$ Time source is hardware calendar (local clock)
  - manually set clock: `R1# clock set 12:00:00 1 jan 2020`
  - verify time setting: `R1# sh clock` $\to$ `12:0:7:578 UTC Wed Jan 1 2020`
  - display more time info: `R1# sh clock detail` $\to$ Time source is user configuration
  - config NTP server: `R1(config)# ntp server 10.1.1.50`
  - verify NTP info:
    - `stratum`: higher value means less trusted

    ```bash
    R1(config)# do sh ntp status
    Clock is unsynchronized , stratum 16, no reference clock
    ...
    interval is 4, never expire
    ```

  - verify time w/ NTP server relation

    ```bash
    R1(config)# do sh ntp association
    address       ref clock     st  when  pool  reach   delay     offset
    disp  
     ~10.1.1.50   0.0.0.5       16  -     64    0       0.00      0.00
    16000.00
     * system peer, # selected, + candidate, - outlyer, x falseticker, ~ configured
    ```

  - config authentication key (multiple keys allowed): `R1(config)# ntp authentication-key 1 md5 cisco`
  - specify which key using for the NTP server: `R1(config)# ntp trusted-key 1`
  - end config: `R1(config)# end`
  - wait for time synchronization
  - verify time synchronization
    - R1 w/ stratum = 2; NTP w/ stratum = 1

    ```bash
    R1# sh ntp status
    Clock is synchronized , stratum 2, reference is 10.1.1.50
    ...
    interval is 4, last update was 12 sec ago

    R1# sh clock
    8:41:29.970 UTC Wed Nov 25 2020
    R1# sh ntp association
    address       ref clock     st  when  pool  reach   delay     offset
    disp  
    *~10.1.1.50   127.127.1.1   1   7     16    3       0.00      0.00
    0.12
     * system peer, # selected, + candidate, - outlyer, x falseticker, ~ configured
    ```


