# DHCP snooping

Trainer: Charles Judd


- DHCP snooping
  - layer 2 protection from unauthorized DHCP server
  - trusted and untrusted ports designated
  - DHCP snooping binding database
  - used for Dynamic ARP Inspection (DIA)


- Demo: pre-config for DHCP snooping
  - topology

    <figure style="margin: 0.5em; display: flex; justify-content: center; align-items: center;">
      <img style="margin: 0.1em; padding-top: 0.5em; width: 20vw;"
        onclick= "window.open('page')"
        src    = "img/12.12-dhcp.png"
        alt    = "Topology for DHCP snooping demo"
        title  = "Topology for DHCP snooping demo"
      />
    </figure>

  - task: only allow Gi0/0 intf to carry traffic w/ DHCP info
  - DHCP-server: a router to handle DHCP info

    ```bash
    DHCP-Server# sh ip dhcp pool

    Pool DHCP :
     Utilization mark (high/low)    : 100/0
     Subnet size (first/next)       : 0 / 0
     Total addresses                : 254
     Leased addresses               : 0
     Pending event                  : none
     1 subnet is currently in the pool :
     Current index    IP address range            Leased addresses
     10.1.1.1         10.1.1.1     - 10.1.1.254    0
    ```

  - client PC discover DHCP server to obtain IP addr: `VPCS> ip dhcp` $\to$ `DDORA IP 10.1.1.51/24` 
  - display IP address info on client PC

    ```bash
    VPCS> sh ip

    NAME        : VPCS[1]
    IP/MASK     : 10.1.1.51/24
    GATEWAY     : 0.0.0.0
    DNS         : 
    DHCP SERVER : 10.1.1.1
    ...
    ```
  
  - verify DHCP server

    ```bash
    DHCP-Server# sh ip dhcp pool

    Pool DHCP :
     Utilization mark (high/low)    : 100/0
     Subnet size (first/next)       : 0 / 0
     Total addresses                : 254
     Leased addresses               : 1
     Pending event                  : none
     1 subnet is currently in the pool :
     Current index    IP address range            Leased addresses
     10.1.1.52        10.1.1.1     - 10.1.1.254    0
    ```
  
- Demo: config DHCP snooping
  - enable dhcp snooping on SW: `SW(config)# ip dhcp snooping`
  - enable dhcp on a vlan (multiple & range allowed): `SW(config)# ip dhcp snooping vlan 1` $\to$ all intfs untrusted
  - verify untrust status by requesting IP addr again: `VPCS> ip dhcp` $\to$ `DDD\n Can't find dhcp server`
  - enter Gi0/0 config mode: `SW(config)# int gig 0/0`
  - config intf as a trusted port: `SW(config-if)# ip dhcp snooping trust`
    - `trust`: DHCP snooping trust config
  - verify config

    ```bash
    SW# sh ip dhcp snooping
    Switch DHCP snooping is enabled
    Switch DHCP gleaning is disabled
    DHCP snooping is configured on following VLANs:
    1
    ...
    Interface           Trusted   Allow option    Rate limit (pps)
    ------------------- -------   ------------    ----------------
    GigabitEthernet0/0  yes       yes             unlimited
      Custom circuit-ids:
    ```
  
  - verify trust status w/ PC: `VPCS> ip dhcp` $\to$  `DORA IP 10.1.1.51/24`


- Dmo: limit DHCP traffic allowed on ports
  - enter ranged intf config mode: `SW(config)# int range fif 0/1-3`
  - config these intfs: `SW(config-if-range)# ip dhcp snooping limit rate 100`
    - `limit`: DHCP snooping limit
    - `100`: DHCP snooping rate limit, <1-2048>
  - verify dncp snooping config: 

    ```bash
    SW# sh ip dhcp snooping
    Switch DHCP snooping is enabled
    Switch DHCP gleaning is disabled
    DHCP snooping is configured on following VLANs:
    1
    ...
    Interface           Trusted   Allow option    Rate limit (pps)
    ------------------- -------   ------------    ----------------
    GigabitEthernet0/0  yes       yes             unlimited
      Custom circuit-ids:
    GigabitEthernet0/1  no        no              100
      Custom circuit-ids:
    GigabitEthernet0/2  no        no              100
      Custom circuit-ids:
    GigabitEthernet0/3  no        no              100
      Custom circuit-ids:
    ```

  - verify dhcp binding table

    ```bash
    SW# sh ip dhcp snooping binding
    MacAddress          IpAddress       Lease(sec)  Type          VLAN  Interface
    ------------------  --------------  ----------  ------------- ----  --------------------
    00:50:79:66:68:04   10.1.1.51       68238       dhcp-snooping  1     GigabitEthernet0/1
    Total number of bindings: 1
    ```



