
Hands-on Lab # 6: VLANs, Trunking and Port-Aggregation

Objective:
To configure VLANs, STP, trunking and Port-Aggregation protocol as per given requirements.

Scenario:
You have been tasked with configuring SwitchB, which has a minimal configuration and has been added to the existing network as shown in the topology diagram.

SwitchA is currently configured correctly, but will need to be modified to support the addition of SwitchB. The VTP and STP configuration modes on SwitchA should not be modified. However, SwitchA needs to be the root swtich for all vlan instances.

The two connections between SwitchA and SwitchB need to be configured using a non-proprietary protocol that allows both the lines to be actively forwarding the data, with SwitchA controlling the activation. Propagation of unnecessary broadcasts should be limited using manual pruning on this trunk link.

For operational and security reasons trunking between SwitchA and SwitchB should be unconditional and Vlan1 and other access vlans need to be tagged when traversing the trunk link.

Requirements for SwitchB

Vlan RST ID = 21, supports two servers attached to fa0/9 and fa0/10
Vlan SST ID = 22, supports two servers aatached to fa0/13 and fa0/14
Vlan TST ID = 23, supports two servers aatached to fa0/15 and fa0/16
Access ports supporting servers must transition immediately to forwarding state.
No routing is to be supported on SwitchB
Only SVI Vlan 1 is to be configured and it is to use address 192.168.1.11/24
SwitchA and SwitchB use cisco as the enable password.
Ensure that devices on SwitchB can reach devices behind RouterA.

Exhibit:

Configuration:

Step 1: Check existing configuration

Switch A: The Distribution Layer Switch

Use the show cdp neighbors detail command to see RouterA interface fa0/0 address. It is 192.168.1.10. It is needed to be set as the default gateway for SwitchB.
Check Vlans 1, 11-13, 98-99, if already created and identify the Native Vlan 99 and its name: TrunkNative
Check all the interfaces, especially FastEthernet 0/3 and 0/4 for Vlan assignment because in some cases these interfaces were already assigned to a Vlan 98. If so, we need to remove them from Vlan 98. We will configure them as trunk ports.

Switch B: The Access Layer Switch

Check existing VLANs. Only VLAN1 exists.
Check that SVI is assigned to VLAN1 as indicated in the question. Most of the time it is already configured in exam as 192.168.1.11/24.

Step 2: VLAN/STP Configuration on SwitchB

Configure VLANs
Assign ports; enable PortFast on access ports
Configure default gateway to ensure that devices on SwitchB can reach devices behind RouterA.

SwitchB>en
Password:cisco
SwitchB#conf t
Enter configuration commands, one per line. End with CNTL/Z.

SwitchB(config)#vlan 21
SwitchB(config-vlan)#name RST
SwitchB(config-vlan)#vlan 22
SwitchB(config-vlan)#name SST
SwitchB(config-vlan)#vlan 23
SwitchB(config-vlan)#name TST
SwitchB(config-vlan)#vlan 99
SwitchB(config-vlan)#name TrunkNative
SwitchB(config-vlan)#exit

SwitchB(config)#int range fa0/9 – 10
SwitchB(config-if-range)#switchport mode access
SwitchB(config-if-range)#switchport access vlan 21
SwitchB(config-if-range)#spanning-tree portfast
SwitchB(config-if-range)#exit

SwitchB(config)#int range fa0/13 – 14
SwitchB(config-if-range)#switchport mode access
SwitchB(config-if-range)#switchport access vlan 22
SwitchB(config-if-range)#spanning-tree portfast
SwitchB(config-if-range)#exit

SwitchB(config)#int range fa0/15 – 16
SwitchB(config-if-range)#switchport mode access
SwitchB(config-if-range)#switchport access vlan 23
SwitchB(config-if-range)#spanning-tree portfast
SwitchB(config-if-range)#exit
SwitchB(config)#

SwitchB(config)#interface Vlan1
SwitchB(config-if)#ip address 192.168.1.11 255.255.255.0
//As given in question that only SVI Vlan 1 is to be configured and it is to use address 192.168.1.11/24. Normally this is already configured.

SwitchB(config-if)#exit
SwitchB(config)#ip default-gateway 192.168.1.10
SwitchB(config)#

SwitchB(config)#spanning-tree vlan 1,11-13,21-23,98-99 priority 61440
//Setting the spanning-tree vlan priority command with the highest allowed priority value of 61440, ensures that the other switch (SwitchA), having default priority set to a lower value of 32768, becomes the root bridge.

//If the question states that SwitchA needed to be the root switch for vlans 11, 12, 13, 21, 22, 23, 98 and 99. All other vlans should be left at their default values, then do not include vlan 1 in above command.

Step 3: VLAN/STP Configuration on SwitchA

Configure VLANs.
Make SwitchA the ROOT switch for all VLANs. This goal is already achieved in above configuration on SwitchB, by changing its priority.

SwitchA>en
Password:cisco
SwitchA#conf t
Enter configuration commands, one per line. End with CNTL/Z.

SwitchA(config)#vlan 21
SwitchA(config-vlan)#name RST
SwitchA(config-vlan)#vlan 22
SwitchA(config-vlan)#name SST
SwitchA(config-vlan)#vlan 23
SwitchA(config-vlan)#name TST
SwitchA(config-vlan)#vlan 99
SwitchB(config-vlan)#name TrunkNative
SwitchA(config-vlan)#exit

Step 4: Configure Trunk Ports and Port-Aggregation on SwitchA

The two connections between SwitchA and SwitchB need to be configured using a non-proprietary protocol that allows both the lines to be actively forwarding the data, with SwitchA controlling the activation.
Propagation of unnecessary broadcasts should be limited using manual pruning on this trunk link.
For operational and security reasons trunking between SwitchA and SwitchB should be unconditional and Vlan1 and other access vlans need to be tagged when traversing the trunk link.

SwitchA(config)#int range fa0/3 – 4
SwitchA(config-if-range)#no switchport access vlan 98
SwitchA(config-if-range)#switchport mode trunk
SwitchA(config-if-range)#switchport trunk allowed vlan 1,21-23
SwitchA(config-if-range)#switchport trunk native vlan 99

SwitchA(config-if-range)#channel-protocol lacp
SwitchA(config-if-range)#channel-group 1 mode active
SwitchA(config-if-range)#exit

SwitchA(config)#int port-channel 1
SwitchA(config-if)#switchport trunk native vlan 99
//Use above two commands if you get any vlan mismatch notifications, otherwise not needed.

SwitchA(config-if)#end
SwitchA#

Step 5: Configure Trunk Ports and Port-Aggregation on SwitchB

SwitchB(config)#int range fa0/3 – 4
SwitchB(config-if-range)#switchport trunk encapsulation dot1q
//Ignore above one command if not accepted
SwitchB(config-if-range)#switchport mode trunk
SwitchB(config-if-range)#switchport trunk allowed vlan 1,21-23
SwitchB(config-if-range)#switchport trunk native vlan 99

SwitchB(config-if-range)#channel-protocol lacp
SwitchB(config-if-range)#channel-group 1 mode passive
SwitchB(config-if-range)#exit

SwitchB(config)#int port-channel 1
SwitchB(config-if)#switchport trunk native vlan 99
//Use above two commands if you get any vlan mismatch notifications, otherwise not needed.

SwitchB(config-if)#end
SwitchB#

Note: The copy run start command is allowed in newer Cisco simulations.
Step 6: Verification

Your configuration will be correct when you can ping from SwitchB to RouterC, IP address 192.168.1.10.

SwitchB#ping 192.168.1.10

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.1.10, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 62/62/63 ms

Use the show spanning-tree command on SwitchA to verify its STP role as ROOT for all VLANs.

SwitchA#show spanning-tree
VLAN0001
Spanning tree enabled protocol ieee
Root ID Priority 32768
Address 0010.1122.E2B7
This bridge is the root
Hello Time 2 sec Max Age 20 sec Forward Delay 15 sec